app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def setup_current_user
    if session[:user_id] != nil
      @current_user = User.find(session[:user_id])