app/controllers/project_controller.rb

INSERT INTO "projects" ("title", "image_name", "overview", "recruitment_date_start", "recruitment_date_finish", "target_number_of_people", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def new_action
    # TODO: 画像をアップロード
    # TODO: 画像のバリデーション
    # TODO: 日付のバリデーション
    @title = params[:title]
    @image = params[:image]
    @overview = params[:overview]
    @category = params[:category]
    @recruitment_date_start = params[:recruitment_date_start]
    @recruitment_date_finish = params[:recruitment_date_finish]
    @target_number_of_people = params[:target_number_of_people]
    @text = params[:text]
    @project = Project.new(
        user_id: @current_user.id,
        title: @title,
        image_name: "default.png",
        overview: @overview,
        # category: @category,
        recruitment_date_start: @recruitment_date_start,
        recruitment_date_finish: @recruitment_date_finish,
        target_number_of_people: @target_number_of_people.to_i,
        text: @text
    )
    if @project.save